app/Controllers/Admin.php

    public function dashboard()
    {
        if (!session()->get('logged_in') || session()->get('role') !== 'admin') {
        return redirect()->to('/login');
    }

    $this->trackingOtomatis(); // ← Tambahkan ini agar auto update juga di dashboard

    $db = \Config\Database::connect();
    $layanan = $db->table('layanan')->get()->getResultArray();
    $pesananBaru = $db->table('pesanan')->where('status', 'Menunggu')->countAllResults();
---
SELECT *
FROM `layanan`
SELECT COUNT(*) AS `numrows`
FROM `pesanan`
WHERE `status` = 'Menunggu'

    public function pelanggan()
    {
        $pelangganModel = new PelangganModel();
        $data['pelanggan'] = $pelangganModel->findAll();
---
SELECT *
FROM `pelanggan`

  public function update_status()
{
    $id = $this->request->getPost('id');
    $status = $this->request->getPost('status');

    $data = ['status' => $status];

    if ($status == 'diantar') {
        $data['waktu_diantar'] = date('Y-m-d H:i:s'); // waktu diantar tercatat
    }

    $db = \Config\Database::connect();
    $db->table('pesanan')->where('id', $id)->update($data); // gunakan $data lengkap
---
UPDATE `pesanan` SET `status` = 'diantar', `waktu_diantar` = '2025-07-12 09:51:13'
WHERE `id` = '1'

public function trackingOtomatis()
{ $pesanan = $this->pesananModel
        ->where('status', 'diantar')
        ->where('waktu_diantar IS NOT NULL')
        ->findAll();

    // Tambahkan untuk debug
    // dd($pesanan);

    foreach ($pesanan as $row) {
        $waktuMulai = strtotime($row['waktu_diantar']);
        $sekarang   = time();
        $durasi     = $sekarang - $waktuMulai;

        if ($durasi >= 1800) {
            $this->pesananModel->update($row['id'], ['status' => 'Selesai']);
---
SELECT *
FROM `pesanan`
WHERE `status` = 'diantar'
AND `waktu_diantar` IS NOT NULL
UPDATE `pesanan` SET `status` = 'Selesai'
WHERE `pesanan`.`id` IN ('7')