app/Controllers/Pelanggan.php

public function dashboard_plg()
{
    $id_plg = session()->get('user_id');
    $db = \Config\Database::connect();

    // Ambil data layanan
    $layanan = $db->table('layanan')->get()->getResultArray();

    // Ambil data pesanan user
    $jadwal = $db->table('pesanan')
        ->where('user_id', $id_plg)
        ->orderBy('waktu', 'DESC')
        ->get()->getResultArray();
---
SELECT *
FROM `layanan`
SELECT *
FROM `pesanan`
WHERE `user_id` = '29'
ORDER BY `waktu` DESC