app/Controllers/pesanan.php

SELECT `pesanan`.*, `users`.`nama`
FROM `pesanan`
JOIN `users` ON `users`.`id` = `pesanan`.`user_id`
SELECT *
FROM `layanan`
---
    public function index()
    {
        $db = \Config\Database::connect();

        $pesanan = $db->table('pesanan')
            ->select('pesanan.*, users.nama')
            ->join('users', 'users.id = pesanan.user_id')
            ->get()
            ->getResultArray();

        $semua_layanan = $db->table('layanan')->get()->getResultArray();